{
  "total_books": 46,
  "total_pages": 22754,
  "avg_pages": 494.7,
  "avg_rating": 4.72,
  "series_counts": {
    "Elantris": 1,
    "Mistborn": 2,
    "The Ruinous Love Trilogy": 3,
    "Архив Буресвета": 2,
    "Голодные игры": 1,
    "Изменённые": 4,
    "Канашибари": 2,
    "Кваzи": 2,
    "Соглашение": 3
  },
  "books_2025": 41,
  "book_list": [
    {
      "Title": "Давший клятву",
      "Author": "Brandon Sanderson",
      "Additional Authors": "Брендон Сандерсон",
      "Number of Pages": 1770,
      "Estimated Word Count": 486750,
      "Date Read": null,
      "Date Added": "2025-10-05",
      "My Rating": 0,
      "Series": null,
      "Bookshelves": "currently-reading",
      "Bookshelves with positions": "currently-reading (#1)",
      "Exclusive Shelf": "currently-reading",
      "ISBN": "5389161416",
      "ISBN13": "9785389161412",
      "Cover URL": "http://books.google.com/books/content?id=VsT3DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "The #1 New York Times bestselling sequel to Words of Radiance, from epic fantasy author Brandon Sanderson at the top of his game. In Oathbringer, the third volume of the New York Times bestselling Stormlight Archive, humanity faces a new Desolation with the return of the Voidbringers, a foe with numbers as great as their thirst for vengeance. Dalinar Kholin’s Alethi armies won a fleeting victory at a terrible cost: The enemy Parshendi summoned the violent Everstorm, which now sweeps the world with destruction, and in its passing awakens the once peaceful and subservient parshmen to the horror of their millennia-long enslavement by humans. While on a desperate flight to warn his family of the threat, Kaladin Stormblessed must come to grips with the fact that the newly kindled anger of the parshmen may be wholly justified. Nestled in the mountains high above the storms, in the tower city of Urithiru, Shallan Davar investigates the wonders of the ancient stronghold of the Knights Radiant and unearths dark secrets lurking in its depths. And Dalinar realizes that his holy mission to unite his homeland of Alethkar was too narrow in scope. Unless all the nations of Roshar can put aside Dalinar’s blood-soaked past and stand together—and unless Dalinar himself can confront that past—even the restoration of the Knights Radiant will not prevent the end of civilization. Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive ● The Way of Kings ● Words of Radiance ● Edgedancer (novella) ● Oathbringer ● Dawnshard (novella) ● Rhythm of War The Mistborn Saga The Original Trilogy ● Mistborn ● The Well of Ascension ● The Hero of Ages Wax and Wayne ● The Alloy of Law ● Shadows of Self ● The Bands of Mourning ● The Lost Metal Other Cosmere novels ● Elantris ● Warbreaker ● Tress of the Emerald Sea ● Yumi and the Nightmare Painter ● The Sunlit Man Collection ● Arcanum Unbounded: The Cosmere Collection The Alcatraz vs. the Evil Librarians series ● Alcatraz vs. the Evil Librarians ● The Scrivener's Bones ● The Knights of Crystallia ● The Shattered Lens ● The Dark Talent ● Bastille vs. the Evil Librarians (with Janci Patterson) Other novels ● The Rithmatist ● Legion: The Many Lives of Stephen Leeds ● The Frugal Wizard’s Handbook for Surviving Medieval England Other books by Brandon Sanderson The Reckoners ● Steelheart ● Firefight ● Calamity Skyward ● Skyward ● Starsight ● Cytonic ● Skyward Flight (with Janci Patterson) ● Defiant At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
      "Book Id": "44715414",
      "Days Spent": null
    },
    {
      "Title": "Гранетанцор",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 350,
      "Estimated Word Count": 96250,
      "Date Read": "2025-10-05",
      "Date Added": "2025-10-04",
      "My Rating": 0,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=2_NrDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "From #1 New York Times bestselling author Brandon Sanderson, a special gift edition of Edgedancer, a short novel of the Stormlight Archive (previously published in Arcanum Unbounded). Three years ago, Lift asked a goddess to stop her from growing older--a wish she believed was granted. Now, in Edgedancer, the barely teenage nascent Knight Radiant finds that time stands still for no one. Although the young Azish emperor granted her safe haven from an executioner she knows only as Darkness, court life is suffocating the free-spirited Lift, who can't help heading to Yeddaw when she hears the relentless Darkness is there hunting people like her with budding powers. The downtrodden in Yeddaw have no champion, and Lift knows she must seize this awesome responsibility. Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive The Way of Kings Words of Radiance Edgedancer (Novella) Oathbringer The Mistborn trilogy Mistborn: The Final Empire The Well of Ascension The Hero of Ages Mistborn: The Wax and Wayne series Alloy of Law Shadows of Self Bands of Mourning Collection Arcanum Unbounded Other Cosmere novels Elantris Warbreaker The Alcatraz vs. the Evil Librarians series Alcatraz vs. the Evil Librarians The Scrivener's Bones The Knights of Crystallia The Shattered Lens The Dark Talent The Rithmatist series The Rithmatist Other books by Brandon Sanderson The Reckoners Steelheart Firefight Calamity At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
      "Book Id": "39441761",
      "Days Spent": 1.0
    },
    {
      "Title": "Слова сияния",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 1550,
      "Estimated Word Count": 426250,
      "Date Read": "2025-10-04",
      "Date Added": "2025-09-26",
      "My Rating": 0,
      "Series": "Архив Буресвета",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5389135628",
      "ISBN13": "9785389135628",
      "Cover URL": "http://books.google.com/books/content?id=sE4sDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "Вопреки ожиданиям врагов, Каладин Благословенный Бурей не умер рабом, но возглавил личную гвардию великого князя, и теперь на его плечах лежит обязанность защищать самого короля. Убийца в Белом вновь сеет смерть по всему Рошару, шаг за шагом приближаясь к главной цели — Далинару Холину. Шаллан Давар ставит перед собой самую амбициозную цель из всех возможных: предотвратить возвращение Приносящих пустоту, за которым должна последовать гибель всего мира. А в это время в сердце Расколотых равнин паршенди, уставшие от многолетней войны, делают роковой выбор и обращаются за помощью к той самой силе, от которой некогда бежали их предки. Выдержат ли герои новые испытания? Станут ли новыми Сияющими рыцарями? Над Рошаром сгущаются тени: до конца света осталось всего-навсего шестьдесят два дня.",
      "Book Id": "36557307",
      "Days Spent": 8.0
    },
    {
      "Title": "Путь королей",
      "Author": "Brandon Sanderson",
      "Additional Authors": "Брендон Сандерсон, Наталия Осояну",
      "Number of Pages": 1152,
      "Estimated Word Count": 316800,
      "Date Read": "2025-09-25",
      "Date Added": "2025-09-08",
      "My Rating": 5,
      "Series": "Архив Буресвета",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5389099427",
      "ISBN13": "9785389099425",
      "Cover URL": "http://books.google.com/books/content?id=LN_a49HEpmwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "A new epic fantasy series from the New York Times bestselling author chosen to complete Robert Jordan's The Wheel of Time® Series",
      "Book Id": "30843909",
      "Days Spent": 17.0
    },
    {
      "Title": "11/22/63",
      "Author": "Stephen        King",
      "Additional Authors": "",
      "Number of Pages": 849,
      "Estimated Word Count": 233475,
      "Date Read": "2025-09-05",
      "Date Added": "2025-08-31",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "1451627289",
      "ISBN13": "9781451627282",
      "Cover URL": "http://books.google.com/books/content?id=2miSngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [],
      "Annotation": "Receiving a horrific essay from a GED student with a traumatic past, high-school English teacher Jake Epping is enlisted by a friend to travel back in time to prevent the assassination of John F. Kennedy, a mission for which he must reacclimate to 1960s culture and befriend troubled loner Lee Harvey Oswald. By the best-selling author of Full Dark, No Stars.",
      "Book Id": "10644930",
      "Days Spent": 5.0
    },
    {
      "Title": "Граф Монте-Кристо. Том 1",
      "Author": "Alexandre Dumas",
      "Additional Authors": "Александр Дюма",
      "Number of Pages": 640,
      "Estimated Word Count": 176000,
      "Date Read": "2025-08-19",
      "Date Added": "2025-09-02",
      "My Rating": 0,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=fVIcEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "60212264",
      "Days Spent": -14.0
    },
    {
      "Title": "Убийца войн",
      "Author": "Brandon Sanderson",
      "Additional Authors": "Брендон Сандерсон",
      "Number of Pages": 673,
      "Estimated Word Count": 185075,
      "Date Read": "2025-08-30",
      "Date Added": "2025-08-26",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=1ITREAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "40541639",
      "Days Spent": 4.0
    },
    {
      "Title": "Граф Монте-Кристо. Том 2",
      "Author": "Alexandre Dumas",
      "Additional Authors": "Александр Дюма",
      "Number of Pages": 608,
      "Estimated Word Count": 167200,
      "Date Read": "2025-08-23",
      "Date Added": "2025-08-19",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=b1IcEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Russian fiction"
      ],
      "Annotation": null,
      "Book Id": "60300408",
      "Days Spent": 4.0
    },
    {
      "Title": "Канашибари. Пока не погаснет последний фонарь. Том 3",
      "Author": "SHen Angelina SHen Veronika",
      "Additional Authors": "Вероника Шэн",
      "Number of Pages": 475,
      "Estimated Word Count": 130625,
      "Date Read": "2025-08-13",
      "Date Added": "2025-08-07",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5353109864",
      "ISBN13": "9785353109860",
      "Cover URL": "http://books.google.com/books/content?id=Ol54EQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "232193662",
      "Days Spent": 6.0
    },
    {
      "Title": "Космер. Тайная история",
      "Author": "Brandon Sanderson",
      "Additional Authors": "Брендон Сандерсон, Наталья Осояну",
      "Number of Pages": 854,
      "Estimated Word Count": 234850,
      "Date Read": "2025-08-07",
      "Date Added": "2025-08-04",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5389248503",
      "ISBN13": "9785389248502",
      "Cover URL": "http://books.google.com/books/content?id=VoLzEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "Космер — уникальная вселенная, созданная воображением одного из популярнейших авторов в жанре фэнтези. Здесь у каждого мира собственная магическая система. Здесь можно пешком перебираться с планеты на планету. Здесь разворачиваются изощренные, головокружительные сюжеты циклов-бестселлеров «Рожденный туманом», «Архив Буресвета», «Двурожденные», «Белый песок», а также романов «Элантрис» и «Локон с Изумрудного моря». По замыслу Сандерсона, полный цикл о космере составит не менее сорока книг. Повесть «Душа императора» была удостоена премии «Хьюго», а «Гранетанцор» — это новый мини-роман из цикла «Архив Буресвета». Впервые на русском!",
      "Book Id": "208096282",
      "Days Spent": 3.0
    },
    {
      "Title": "The Hero of Ages",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 572,
      "Estimated Word Count": 157300,
      "Date Read": "2025-08-03",
      "Date Added": "2025-07-20",
      "My Rating": 5,
      "Series": "Mistborn",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "0765316897",
      "ISBN13": "9780765316899",
      "Cover URL": "http://books.google.com/books/content?id=X9q_7-nWisgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "Emperor Elend Venture, having survived only to become a Mistborn himself, struggles to find clues by the Lord Ruler that will save his world, while a guilt-consumed Vin takes on a task of ending the cosmic power of the Ruin mystic force.",
      "Book Id": "2767793",
      "Days Spent": 14.0
    },
    {
      "Title": "The Well of Ascension",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 590,
      "Estimated Word Count": 162250,
      "Date Read": "2025-07-17",
      "Date Added": "2025-07-08",
      "My Rating": 5,
      "Series": "Mistborn",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "0765316889",
      "ISBN13": "9780765316882",
      "Cover URL": "http://books.google.com/books/content?id=-EZHf7-jWAQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "\"All of these troubles whisper a single, chilling fact. Killing the Lord Ruler was the easy part. Surviving the aftermath of his fall is going to be the real challenge.\"--BOOK JACKET.",
      "Book Id": "68429",
      "Days Spent": 9.0
    },
    {
      "Title": "Пепел и сталь",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 923,
      "Estimated Word Count": 253825,
      "Date Read": "2025-07-07",
      "Date Added": "2025-07-02",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5389100417",
      "ISBN13": "9785389100411",
      "Cover URL": "http://books.google.com/books/content?id=j0l7CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "Тысячу лет существует Последняя империя, управляемая бессмертным и неуязвимым лордом-правителем, единственным богом и властителем этого мира. Тысячу лет назад он победил в схватке неведомую Бездну, грозившую уничтожить все живое, и, получив огромную силу, поработил мир, вместо того чтобы освободить его. С тех пор с неба в Последней империи сыплется пепел, солнце — цвета крови, а ночью мир обволакивает таинственный туман, отбирающий у людей душу. Способен ли хоть один человек сокрушить всесильного императора? Да, отвечает Кельсер — вор, человек-легенда, совершивший в свое время попытку ограбить дворец самого лорда-правителя, сосланный за это на рудники и сумевший не только выжить, но и бежать на свободу. И начинает собирать силы для решительного удара…",
      "Book Id": "27847423",
      "Days Spent": 5.0
    },
    {
      "Title": "The Eleventh Metal",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 21,
      "Estimated Word Count": 5775,
      "Date Read": null,
      "Date Added": "2025-07-02",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=Df6WDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Молодёжная литература"
      ],
      "Annotation": "This discounted ebundle Fantasy Firsts includes: The Way of Kings, Mistborn: The Final Empire, Rithmatist, Alcatraz vs. The Evil Librarians From #1 New York Times bestselling author of The Stormlight Archive and the Mistborn Saga, this bundle offers four entry points into the worlds of Brandon Sanderson. Mistborn: The Final Empire begins the Mistborn Saga, The Way of Kings the Stormlight Archive, Rithmatist, the first book in the duology, and Alcatraz vs. The Evil Librarians a series by the same name. Prepare yourself to be whisked away to the fantastical worlds of Brandon Sanderson. The Way of Kings — In a war that makes no sense, where ten armies fight separately against a single foe, Kaladin struggles to save his men and to fathom the leaders who consider them expendable. Brightlord Dalinar Kholin commands one of those other armies. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity. Mistborn: The Final Empire — Kelsier, a brilliant thief has turned his talents to the ultimate caper, with the Lord Ruler as the mark. Kel's plan is the ultimate long shot, until luck brings a ragged girl named Vin into the fold. But she will have to learn to trust if she is to master powers of which she never dreamed. The Rithmatist — Assigned to help the professor who is investigating the kidnapping of student Rithmatists, Joel and his friend Melody find themselves on the trail of an unexpected discovery—one that will change Rithmatics—and their world—forever. Alcatraz vs. The Evil Librarians — On his thirteenth birthday, foster child Alcatraz Smedry gets a bag of sand in the mail-his only inheritance from his father and mother. It is quickly stolen by the cult of Evil Librarians. Alcatraz must stop them, using the only weapon he has: an incredible talent for breaking things. Other Tor books by Brandon Sanderson The Cosmere The Stormlight Archive The Way of Kings Words of Radiance Edgedancer (Novella) Oathbringer The Mistborn trilogy Mistborn: The Final Empire The Well of Ascension The Hero of Ages Mistborn: The Wax and Wayne series Alloy of Law Shadows of Self Bands of Mourning Collection Arcanum Unbounded Other Cosmere novels Elantris Warbreaker The Alcatraz vs. the Evil Librarians series Alcatraz vs. the Evil Librarians The Scrivener's Bones The Knights of Crystallia The Shattered Lens The Dark Talent The Rithmatist series The Rithmatist Other books by Brandon Sanderson The Reckoners Steelheart Firefight Calamity At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
      "Book Id": "22823333",
      "Days Spent": null
    },
    {
      "Title": "The Emperor's Soul",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 175,
      "Estimated Word Count": 48125,
      "Date Read": "2025-07-02",
      "Date Added": "2025-07-01",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "1616960922",
      "ISBN13": "9781616960926",
      "Cover URL": "http://books.google.com/books/content?id=m6ziwAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [],
      "Annotation": "Sentenced to death after attempting to steal the emperor's scepter, Shai, a Forger, is given one chance to save her own life, using it to try to create a new soul for the nearly dead emperor.",
      "Book Id": "13578175",
      "Days Spent": 1.0
    },
    {
      "Title": "The Hope of Elantris",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 25,
      "Estimated Word Count": 6875,
      "Date Read": "2025-07-01",
      "Date Added": "2025-07-01",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=LXPq0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "10852065",
      "Days Spent": 0.0
    },
    {
      "Title": "Город богов",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 640,
      "Estimated Word Count": 176000,
      "Date Read": "2025-07-01",
      "Date Added": "2025-06-23",
      "My Rating": 5,
      "Series": "Elantris",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5352015823",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=R_nt5CFaJKEC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [],
      "Annotation": "Elantris was built on magic and it thrived. But then the magic began to fade and Elantris began to rot. And now its shattered citizens face domination by a powerful Imperium motivated by dogged religious views. Can a young Princess unite the people of Elantris, rediscover the lost magic and lead a rebellion against the imperial zealots? Brandon Sanderson's debut fantasy showed his skill as a storyteller and an imaginer of baroque magical systems to be fully developed from the start.",
      "Book Id": "15699725",
      "Days Spent": 8.0
    },
    {
      "Title": "Sunrise on the Reaping",
      "Author": "Suzanne Collins",
      "Additional Authors": "",
      "Number of Pages": 387,
      "Estimated Word Count": 106425,
      "Date Read": "2025-06-22",
      "Date Added": "2025-06-19",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "1546171460",
      "ISBN13": "9781546171461",
      "Cover URL": "http://books.google.com/books/content?id=7NDJ0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [
        "Молодёжная литература"
      ],
      "Annotation": "The phenomenal fifth book in the Hunger Games series! When you've been set up to lose everything you love, what is there left to fight for? As the day dawns on the fiftieth annual Hunger Games, fear grips the districts of Panem. This year, in honor of the Quarter Quell, twice as many tributes will be taken from their homes. Back in District 12, Haymitch Abernathy is trying not to think too hard about his chances. All he cares about is making it through the day and being with the girl he loves. When Haymitch's name is called, he can feel all his dreams break. He's torn from his family and his love, shuttled to the Capitol with the three other District 12 tributes: a young friend who's nearly a sister to him, a compulsive oddsmaker, and the most stuck-up girl in town. As the Games begin, Haymitch understands he's been set up to fail. But there's something in him that wants to fight . . . and have that fight reverberate far beyond the deadly arena.",
      "Book Id": "214331246",
      "Days Spent": 3.0
    },
    {
      "Title": "The Ballad of Songbirds and Snakes",
      "Author": "Suzanne Collins",
      "Additional Authors": "",
      "Number of Pages": 541,
      "Estimated Word Count": 148775,
      "Date Read": "2025-06-17",
      "Date Added": "2025-06-14",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=NrahDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Молодёжная литература"
      ],
      "Annotation": "Ambition will fuel him. Competition will drive him. But power has its price. It is the morning of the reaping that will kick off the tenth annual Hunger Games. In the Capitol, eighteen-year-old Coriolanus Snow is preparing for his one shot at glory as a mentor in the Games. The once-mighty house of Snow has fallen on hard times, its fate hanging on the slender chance that Coriolanus will be able to outcharm, outwit, and outmaneuver his fellow students to mentor the winning tribute. The odds are against him. He's been given the humiliating assignment of mentoring the female tribute from District 12, the lowest of the low. Their fates are now completely intertwined - every choice Coriolanus makes could lead to favor or failure, triumph or ruin. Inside the arena, it will be a fight to the death. Outside the arena, Coriolanus starts to feel for his doomed tribute . . . and must weigh his need to follow the rules against his desire to survive no matter what it takes.",
      "Book Id": "51901147",
      "Days Spent": 3.0
    },
    {
      "Title": "Mockingjay",
      "Author": "Suzanne Collins",
      "Additional Authors": "",
      "Number of Pages": 390,
      "Estimated Word Count": 107250,
      "Date Read": "2025-06-07",
      "Date Added": "2025-06-04",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "0439023513",
      "ISBN13": "9780439023511",
      "Cover URL": "http://books.google.com/books/content?id=Iw_gHtk4ghYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Juvenile Fiction"
      ],
      "Annotation": "Against all odds, Katniss Everdeen has survived the Hunger Games twice. But now that she's made it out of the bloody arena alive, she's still not safe. The Capitol is angry. The Capitol wants revenge. Who do they think should pay for the unrest? Katniss. And what's worse, President Snow has made it clear that no one else is safe either. Not Katniss's family, not her friends, not the people of District 12. Powerful and haunting, this thrilling final installment of Suzanne Collins's groundbreaking The Hunger Games trilogy promises to be one of the most talked about books of the year.",
      "Book Id": "7260188",
      "Days Spent": 3.0
    },
    {
      "Title": "Джейн Эйр",
      "Author": "Charlotte Brontë",
      "Additional Authors": "Шарлотта Бронте, Ирина Гурова",
      "Number of Pages": 666,
      "Estimated Word Count": 183150,
      "Date Read": "2024-12-20",
      "Date Added": "2024-12-17",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5448470971",
      "ISBN13": "9785448470974",
      "Cover URL": "http://books.google.com/books/content?id=qhmFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [],
      "Annotation": "Бронте, Ш. Джейн Эйр / Шарлотта Бронте ; [пер. с англ. И.Г. Гуровой]. — М. : Издательство Вече, 2017. — 576 с. — (100 великих романов). Знак информационной продукции 12+ Самый знаменитый роман английской писательницы Шарлотты Бронте (1816—1865) продолжает и в наше время волновать сердца миллионов. Умная и образованная героиня стала примером для многих поколений юных читательниц. События романа происходят в мрачном готическом замке в поместье Торнфильд, где раскрываются страшные тайны, а страстная любовь героев встречает на своем пути множество непреодолимых препятствий.",
      "Book Id": "40536979",
      "Days Spent": 3.0
    },
    {
      "Title": "Catching Fire",
      "Author": "Suzanne Collins",
      "Additional Authors": "",
      "Number of Pages": 391,
      "Estimated Word Count": 107525,
      "Date Read": "2025-06-04",
      "Date Added": "2025-05-27",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "0439023491",
      "ISBN13": "9780439023498",
      "Cover URL": "http://books.google.com/books/content?id=fsC7uQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [
        "Large type books"
      ],
      "Annotation": "By winning the annual Hunger Games, District 12 tributes Katniss Everdeen and Peeta Mellark have secured a life of safety and plenty for themselves and their families, but because they won by defying the rules, they unwittingly become the faces of an impending rebellion.",
      "Book Id": "6148028",
      "Days Spent": 8.0
    },
    {
      "Title": "Голодные игры",
      "Author": "Suzanne Collins",
      "Additional Authors": "Сьюзен Коллинз, Alexey Shipulin, Алексей Шипулин",
      "Number of Pages": 384,
      "Estimated Word Count": 105600,
      "Date Read": "2025-05-27",
      "Date Added": "2025-05-19",
      "My Rating": 5,
      "Series": "Голодные игры",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5170624638",
      "ISBN13": "9785170624638",
      "Cover URL": "http://books.google.com/books/content?id=_zSzAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Литературные сборники"
      ],
      "Annotation": "\"Голодные игры\" - жестокий, талантливый, написанный с колоссальным драйвом роман, в котором напряжение нарастает с каждой страницей",
      "Book Id": "7769068",
      "Days Spent": 8.0
    },
    {
      "Title": "Сто лет одиночества",
      "Author": "Gabriel García Márquez",
      "Additional Authors": "Габриэль Гарсиа Маркес",
      "Number of Pages": 414,
      "Estimated Word Count": 113850,
      "Date Read": null,
      "Date Added": "2025-05-13",
      "My Rating": 0,
      "Series": null,
      "Bookshelves": "stopped-reading",
      "Bookshelves with positions": "stopped-reading (#1)",
      "Exclusive Shelf": "stopped-reading",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=unIyeOAhwCoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Колумбийская художественная литература"
      ],
      "Annotation": null,
      "Book Id": "6967700",
      "Days Spent": null
    },
    {
      "Title": "Scythe & Sparrow",
      "Author": "Brynne Weaver",
      "Additional Authors": "",
      "Number of Pages": 416,
      "Estimated Word Count": 114400,
      "Date Read": "2025-05-12",
      "Date Added": "2025-05-10",
      "My Rating": 4,
      "Series": "The Ruinous Love Trilogy",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=FBPK0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "127616032",
      "Days Spent": 2.0
    },
    {
      "Title": "Leather & Lark",
      "Author": "Brynne Weaver",
      "Additional Authors": "",
      "Number of Pages": 390,
      "Estimated Word Count": 107250,
      "Date Read": "2025-05-10",
      "Date Added": "2025-05-05",
      "My Rating": 5,
      "Series": "The Ruinous Love Trilogy",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "0349441588",
      "ISBN13": "9780349441580",
      "Cover URL": "http://books.google.com/books/content?id=wipj0AEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "127611580",
      "Days Spent": 5.0
    },
    {
      "Title": "Палач и Дрозд",
      "Author": "Brynne Weaver",
      "Additional Authors": "Бринн Уивер",
      "Number of Pages": 352,
      "Estimated Word Count": 96800,
      "Date Read": "2025-05-05",
      "Date Added": "2025-05-03",
      "My Rating": 5,
      "Series": "The Ruinous Love Trilogy",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5042068430",
      "ISBN13": "9785042068430",
      "Cover URL": "http://books.google.com/books/content?id=FM0UEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "Когда я была ребенком, моя мать исчезла. Убитый горем отец так и не женился вновь, не приняв смерти дорогой жены. А теперь и я, любимая графская дочь, была похищена в день своего двадцатипятилетия!Я оказалась в месте, имеющем дурную славу – в замке лорда Сергея Вартимора, отшельника и вдовца. А по слухам – синей бороды.Множество девушек, плененных его привлекательностью, обаянием и богатством, мечтали выйти за него замуж, но не стали его женами, и некоторые даже... бесследно исчезли!",
      "Book Id": "227899155",
      "Days Spent": 2.0
    },
    {
      "Title": "Книги Земноморья",
      "Author": "Ursula K. Le Guin",
      "Additional Authors": "Урсула Ле Гуин, Charles Vess, Чарльз Весс, Ирина Тогоева",
      "Number of Pages": 1088,
      "Estimated Word Count": 299200,
      "Date Read": "2025-05-03",
      "Date Added": "2025-04-07",
      "My Rating": 4,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5389166949",
      "ISBN13": "9785389166943",
      "Cover URL": "http://books.google.com/books/content?id=g1dNpEZf5YgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "This new, fifth, Earthsea audiobook pits Ged, Tenar, and Tehanu against the dead. A dragon shows the hard way to salvation.",
      "Book Id": "49217991",
      "Days Spent": 26.0
    },
    {
      "Title": "The Aztlanian",
      "Author": "Brandon Sanderson",
      "Additional Authors": "",
      "Number of Pages": 0,
      "Estimated Word Count": 0,
      "Date Read": null,
      "Date Added": "2025-04-25",
      "My Rating": 0,
      "Series": "Rithmatist",
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#10)",
      "Exclusive Shelf": "to-read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=rOQQUJz68q8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Молодёжная литература"
      ],
      "Annotation": "From #1 New York Times bestselling author Brandon Sanderson: his debut novel for the young adult audience More than anything, Joel wants to be a Rithmatist. Chosen by the Master in a mysterious inception ceremony, Rithmatists have the power to infuse life into two-dimensional figures known as Chalklings. Rithmatists are humanity's only defense against the Wild Chalklings—merciless creatures that leave mangled corpses in their wake. Having nearly overrun the territory of Nebrask, the Wild Chalklings now threaten all of the American Isles. As the son of a lowly chalkmaker at Armedius Academy, Joel can only watch as Rithmatist students study the magical art that he would do anything to practice. Then students start disappearing—kidnapped from their rooms at night, leaving trails of blood. Assigned to help the professor who is investigating the crimes, Joel and his friend Melody find themselves on the trail of an unexpected discovery—one that will change Rithmatics—and their world—forever. Bestselling author Brandon Sanderson brings his unique brand of epic storytelling to the teen audience with an engrossing tale of danger and suspense—the first of a series. With his trademark skills in world-building, Sanderson has created a magic system that is so inventive and detailed that that readers who appreciate games of strategy and tactics just may want to bring Rithmatics to life in our world. A Kirkus Reviews Best Book of 2013 A New York Times Book Review Notable Children's Book of 2013 At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
      "Book Id": "17825280",
      "Days Spent": null
    },
    {
      "Title": "Остання обитель бунтарства",
      "Author": "Ірина Грабовська",
      "Additional Authors": "",
      "Number of Pages": 478,
      "Estimated Word Count": 131450,
      "Date Read": null,
      "Date Added": "2025-04-18",
      "My Rating": 0,
      "Series": null,
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#9)",
      "Exclusive Shelf": "to-read",
      "ISBN": "9669483255",
      "ISBN13": "9789669483256",
      "Cover URL": null,
      "Genres": [
        "Fantasy fiction, Ukrainian"
      ],
      "Annotation": null,
      "Book Id": "46049610",
      "Days Spent": null
    },
    {
      "Title": "Рифматист",
      "Author": "Brandon Sanderson",
      "Additional Authors": "Брендон Сандерсон",
      "Number of Pages": 480,
      "Estimated Word Count": 132000,
      "Date Read": "2025-04-07",
      "Date Added": "2025-04-04",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5389241878",
      "ISBN13": "9785389241879",
      "Cover URL": "http://books.google.com/books/content?id=P3vcEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "Больше всего на свете Джоэл мечтает стать рифматистом. Почему? Да потому, что рифматисты обладают способностью оживлять двухмерные фигуры, начертанные мелом. А еще потому, что рифматисты — последняя надежда человечества в борьбе против диких меллингов, которые того и гляди прорвут оборону и уничтожат все живое. Однако не всем мечтам суждено сбыться. Сыну меловых дел мастера стать рифматистом не удалось. И теперь Джоэл может лишь с тоской наблюдать за студентами академии Армедиуса, изо дня в день практикующими магическое искусство, ради которого он готов на все. Но загадочные, внезапные исчезновения студентов дают Джоэлу шанс проявить себя, и вдруг его жизнь коренным образом меняется... Впервые на русском!",
      "Book Id": "200078422",
      "Days Spent": 3.0
    },
    {
      "Title": "Дом лжи",
      "Author": "David Ellis",
      "Additional Authors": "Дэвид Эллис",
      "Number of Pages": 480,
      "Estimated Word Count": 132000,
      "Date Read": "2025-04-04",
      "Date Added": "2025-02-28",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5041859183",
      "ISBN13": "9785041859183",
      "Cover URL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1717535231i/208460125.jpg",
      "Genres": [],
      "Annotation": "Вы часто просыпаетесь и узнаете, что прошли через портал? Вы когда-нибудь летали верхом на светлячке, который являлся бы важной политической фигурой? Путешествовали в обществе говорящего льва и Бабы-яги в отставке? Нет? А представьте себе состояние девочки Кати, которая оказалась втянута в цепь невероятных событий, опасных магических приключений в Северном королевстве планеты Вундивекль! Катя и ее друзья должны объединиться, чтобы раскрыть страшные тайны и восстановить справедливость.",
      "Book Id": "208460125",
      "Days Spent": 35.0
    },
    {
      "Title": "Эммануэль",
      "Author": "Emmanuelle Arsan",
      "Additional Authors": "",
      "Number of Pages": 336,
      "Estimated Word Count": 92400,
      "Date Read": "2025-03-27",
      "Date Added": "2025-03-20",
      "My Rating": 3,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1355947770i/17157096.jpg",
      "Genres": [],
      "Annotation": "This now classic book of erotica is, alongside Story of O, the most famous French underground novel of the late twentieth century and a work of seductive literary merit. Written by the wife of a diplomat in the French Foreign Service, it takes the form of an autobiographical novel, which it may or may not be. As the story opens, Emmanuelle is boarding a plane in London to rejoin her husband in Bangkok. She finds herself powerfully compelled by the overnight passenger seated beside her, and before she has landed, her irrepressible sensual nature has begun to open wide vistas of sexual possibility. As the novel continues, she moves easily from the waiting arms of her husband to intimacies with the wives of his business associates to further explorations and experiences in which the subtle aesthetics of eroticism are expounded-and enacted-to their fullest. Emmanuelle, which has sold hundreds of thousands of copies since its initial clandestine publication in France, relates the movement of a woman from an unconscious to a profoundly conscious sexuality.",
      "Book Id": "17157096",
      "Days Spent": 7.0
    },
    {
      "Title": "The Final Curtain",
      "Author": "Keigo Higashino",
      "Additional Authors": "Giles Murray",
      "Number of Pages": 400,
      "Estimated Word Count": 110000,
      "Date Read": null,
      "Date Added": "2025-03-27",
      "My Rating": 0,
      "Series": "Detective Kaga",
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#8)",
      "Exclusive Shelf": "to-read",
      "ISBN": "1250767520",
      "ISBN13": "9781250767523",
      "Cover URL": "http://books.google.com/books/content?id=qY-tEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [],
      "Annotation": "From the acclaimed author of Malice and Newcomer, a confounding murder in Tokyo is connected to the mystery of the disappearance and death of Detective Kaga's own mother. A decade ago, Tokyo Police Detective Kyoichiro Kaga went to collect the ashes of his recently deceased mother. Years before, she ran away from her husband and son without explanation or any further contact, only to die alone in an apartment far away, leaving her estranged son with many unanswered questions. Now in Tokyo, Michiko Oshitani is found dead many miles from home. Strangled to death, left in the bare apartment rented under a false name by a man who has disappeared without a trace. Oshitani lived far away in Sendai, with no known connection to Tokyo - and neither her family nor friends have any idea why she would have gone there. Hers is the second strangulation death in that approximate area of Tokyo - the other was a homeless man, killed and his body burned in a tent by the river. As the police search through Oshitani's past for any clue that might shed some light, one of the detectives reaches out to Detective Kaga for advice. As the case unfolds, an unexpected connective emerges between the murder (or murders) now and the long-ago case of Detective Kaga's missing mother. The Final Curtain, one of Keigo Higashino's most acclaimed mysteries, brings the story of Detective Kaga to a surprising conclusion in a series of rich, surprising twists.",
      "Book Id": "65213104",
      "Days Spent": null
    },
    {
      "Title": "A Death in Tokyo",
      "Author": "Keigo Higashino",
      "Additional Authors": "Giles Murray",
      "Number of Pages": 368,
      "Estimated Word Count": 101200,
      "Date Read": null,
      "Date Added": "2025-03-27",
      "My Rating": 0,
      "Series": "Detective Kaga",
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#7)",
      "Exclusive Shelf": "to-read",
      "ISBN": "1250767504",
      "ISBN13": "9781250767509",
      "Cover URL": "http://books.google.com/books/content?id=fCdlEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [],
      "Annotation": "In the mind-bending Wings of the Kirin from international bestselling author Keigo Higashino, Tokyo Police Detective Kaga finds himself forced to try and makes sense of a most unusual murder...",
      "Book Id": "59808174",
      "Days Spent": null
    },
    {
      "Title": "Newcomer",
      "Author": "Keigo Higashino",
      "Additional Authors": "Giles Murray",
      "Number of Pages": 352,
      "Estimated Word Count": 96800,
      "Date Read": null,
      "Date Added": "2025-03-27",
      "My Rating": 0,
      "Series": "Detective Kaga",
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#6)",
      "Exclusive Shelf": "to-read",
      "ISBN": "1250067863",
      "ISBN13": "9781250067869",
      "Cover URL": "http://books.google.com/books/content?id=S6xvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "* A New York Times Editor's Choice * \"Part Sherlock Holmes, part Harry Bosch, Higashino's hero is a quietly majestic force to be reckoned with.\" —Kirkus Reviews (starred) International bestseller Keigo Higashino returns with his latest mindbender—Newcomer—as newly transferred Tokyo Police Detective Kyochiro Kaga is assigned to a baffling murder. Detective Kyochiro Kaga of the Tokyo Police Department has just been transferred to a new precinct in the Nihonbashi area of Tokyo. Newly arrived, but with a great deal of experience, Kaga is promptly assigned to the team investigating the murder of a woman. But the more he investigates, the greater number of potential suspects emerges. It isn’t long before it seems nearly all the people living and working in the business district of Nihonbashi have a motive for murder. To prevent the murderer from eluding justice, Kaga must unravel all the secrets surrounding a complicated life. Buried somewhere in the woman’s past, in her family history, and the last few days of her life is the clue that will lead to the murderer. From the international bestseller Keigo Higashino, author of The Devotion of Suspect X, comes one of his finest works of crime fiction yet.",
      "Book Id": "33602102",
      "Days Spent": null
    },
    {
      "Title": "Malice",
      "Author": "Keigo Higashino",
      "Additional Authors": "Alexander O. Smith",
      "Number of Pages": 288,
      "Estimated Word Count": 79200,
      "Date Read": null,
      "Date Added": "2025-03-27",
      "My Rating": 0,
      "Series": "Detective Kaga",
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#5)",
      "Exclusive Shelf": "to-read",
      "ISBN": "1250035600",
      "ISBN13": "9781250035608",
      "Cover URL": "http://books.google.com/books/content?id=ZGBnBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "International bestseller and Edgar Award finalist Keigo Higashino, author of The Devotion of Suspect X, returns with one of his most challenging and dazzling mysteries ever.",
      "Book Id": "20613611",
      "Days Spent": null
    },
    {
      "Title": "Кайноzой",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 320,
      "Estimated Word Count": 88000,
      "Date Read": "2025-03-08",
      "Date Added": "2025-02-26",
      "My Rating": 4,
      "Series": "Кваzи",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "9785171125844",
      "Cover URL": "http://books.google.com/books/content?id=XqF-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "43195781",
      "Days Spent": 10.0
    },
    {
      "Title": "Шестой Дозор",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 384,
      "Estimated Word Count": 105600,
      "Date Read": "2025-03-19",
      "Date Added": "2025-03-08",
      "My Rating": 4,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5170878443",
      "ISBN13": "9785170878444",
      "Cover URL": "http://books.google.com/books/content?id=0ZdyvgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [
        "Фэнтези",
        "Городское фэнтези"
      ],
      "Annotation": null,
      "Book Id": "23753355",
      "Days Spent": 11.0
    },
    {
      "Title": "КВАZИ",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 352,
      "Estimated Word Count": 96800,
      "Date Read": "2025-03-06",
      "Date Added": "2025-02-26",
      "My Rating": 4,
      "Series": "Кваzи",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5170981317",
      "ISBN13": "9785170981311",
      "Cover URL": "http://books.google.com/books/content?id=YHneDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "31327431",
      "Days Spent": 8.0
    },
    {
      "Title": "Признания",
      "Author": "Kanae Minato",
      "Additional Authors": "Канаэ Минато",
      "Number of Pages": 288,
      "Estimated Word Count": 79200,
      "Date Read": null,
      "Date Added": "2025-03-06",
      "My Rating": 0,
      "Series": null,
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#4)",
      "Exclusive Shelf": "to-read",
      "ISBN": "5041857318",
      "ISBN13": "9785041857318",
      "Cover URL": "http://books.google.com/books/content?id=tQ-rDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Biography & Autobiography"
      ],
      "Annotation": "\"Руки мои, не опуститесь...\" – продолжение книги \"Надежда не умирает никогда\", где автор рассказывает о сложном пути провинциальной девчонки, мечтающей стать врачом. Несмотря на препятствия и сложности, возникающие перед ней в достижении своей цели, главная героиня Екатерина Бондарь, не падая духом, преодолевает их. Искренне веря в Бога и получая поддержку, она приобретает новые силы после каждого испытания. В оформлении обложки использована иллюстрация члена Союза Художников – Валь Н.В., выполненная по индивидуальному заказу в 2017 году.",
      "Book Id": "197463112",
      "Days Spent": null
    },
    {
      "Title": "Искупление",
      "Author": "Kanae Minato",
      "Additional Authors": "Канаэ Минато, Е. Кривцова",
      "Number of Pages": 320,
      "Estimated Word Count": 88000,
      "Date Read": null,
      "Date Added": "2025-03-06",
      "My Rating": 0,
      "Series": null,
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#3)",
      "Exclusive Shelf": "to-read",
      "ISBN": "5041907420",
      "ISBN13": "9785041907426",
      "Cover URL": "http://books.google.com/books/content?id=l3SxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Technology & Engineering"
      ],
      "Annotation": "Рассмотрены теоретические основы и практические аспекты вибродиагностики как развивающихся, так и развитых эксплуатационных дефектов, а также принципы оценки технического состояния промышленных роторных машин. Для студентов, изучающих основы технической диагностики машин, аспирантов и слушателей аттестационных учебных центров и курсов повышения квалификации и переподготовки, а также для специалистов, занимающихся разработкой алгоритмов и программ вибродиагностики эксплуатационных дефектов промышленных машин.Содержание пособия отвечает типовой программе подготовки персонала неразрушающего контроля по вибродиагностическому методу в системе экспертизы промышленной безопасности.",
      "Book Id": "202936542",
      "Days Spent": null
    },
    {
      "Title": "Ресторан 06:06:06",
      "Author": "Пом Ю Джин",
      "Additional Authors": "chaerimi",
      "Number of Pages": 242,
      "Estimated Word Count": 66550,
      "Date Read": "2025-03-02",
      "Date Added": "2025-02-25",
      "My Rating": 4,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5353113179",
      "ISBN13": "9785353113171",
      "Cover URL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1737024919i/223689131.jpg",
      "Genres": [
        "Молодёжная литература",
        "Азиатское фэнтези"
      ],
      "Annotation": "Говорят, что ровно в 6 часов 6 минут 6 секунд на одной из улиц Сеула появится загадочный ресторан. Говорят, внутри вас встретит демон, который выглядит точь-в-точь как вы. Говорят, если добудете ему рецепт души того счастливчика, чью жизнь вы мечтаете прожить, то демон исполнит ваше желание.Звезда дорам, купающаяся в любви поклонников; золотой мальчик, делающий головокружительную карьеру; сценарист, обласканный критиками и зрителями; бедная сирота, пленившая сердце богатого наследника... Кто в здравом уме откажется прожить их безупречные жизни?Слышите издевательский смех демона? Будьте осторожны со своими желаниями...",
      "Book Id": "223689131",
      "Days Spent": 5.0
    },
    {
      "Title": "Гордость и предубеждение",
      "Author": "Jane Austen",
      "Additional Authors": "Джейн Остен, Иммануэль Маршак",
      "Number of Pages": 382,
      "Estimated Word Count": 105050,
      "Date Read": null,
      "Date Added": "2025-02-26",
      "My Rating": 0,
      "Series": null,
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#2)",
      "Exclusive Shelf": "to-read",
      "ISBN": "",
      "ISBN13": "9785170166282",
      "Cover URL": "http://books.google.com/books/content?id=5ZFEX5msS6UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Литературные сборники"
      ],
      "Annotation": "\"Гордость и предубеждение\" Джейн Остен - роман, неподвластный ходу времени. Поразительное по глубине, психологизму и изящному, прозрачному лиризму повествование о судьбе молодой женщины и ее нелегкой, полной неуверенности, ошибок и сомнений любви",
      "Book Id": "17566513",
      "Days Spent": null
    },
    {
      "Title": "Убить пересмешника",
      "Author": "Harper Lee",
      "Additional Authors": "Нора Галь, Раиса Облонская",
      "Number of Pages": 416,
      "Estimated Word Count": 114400,
      "Date Read": null,
      "Date Added": "2025-02-26",
      "My Rating": 0,
      "Series": null,
      "Bookshelves": "to-read",
      "Bookshelves with positions": "to-read (#1)",
      "Exclusive Shelf": "to-read",
      "ISBN": "",
      "ISBN13": "9785170835201",
      "Cover URL": "http://books.google.com/books/content?id=YQ6XoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "Genres": [
        "Отцы и дочери"
      ],
      "Annotation": null,
      "Book Id": "13410173",
      "Days Spent": null
    },
    {
      "Title": "Цветы для Элджернона",
      "Author": "Daniel Keyes",
      "Additional Authors": "Сергей Шаров, Дэниел Киз",
      "Number of Pages": 320,
      "Estimated Word Count": 88000,
      "Date Read": "2025-02-25",
      "Date Added": "2025-02-20",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5699157441",
      "ISBN13": "9785699157440",
      "Cover URL": "http://books.google.com/books/content?id=6P_jN6zUuMcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Классика"
      ],
      "Annotation": null,
      "Book Id": "6139677",
      "Days Spent": 5.0
    },
    {
      "Title": "Пять языков любви",
      "Author": "Гэри Чепмен",
      "Additional Authors": "",
      "Number of Pages": 168,
      "Estimated Word Count": 46200,
      "Date Read": "2025-02-12",
      "Date Added": "2025-02-10",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=NJtZAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Психология"
      ],
      "Annotation": "Как выразить любовь вашему спутнику. Любовь можно проявлять по-разному. Доктор Гэри Чепмен утверждает, что существует пять языков любви: Слова поощрения; Время; Подарки; Помощь; Прикосновения.Вы стараетесь показать супругу, что любите его, а он как будто ничего не замечает. Может быть, вы просто говорите на разных языках? Возможно, ваш муж хочет, чтобы вы ему посочувствовали, а вы вместо этого готовите вкусный ужин. Возможно, вашей жене хочется проводить с вами побольше времени, а роскошные букеты, которые вы преподносите каждый вечер, ей не нужны.В конце книги вы найдете руководство по обсуждению, которое поможет вам лучше разобраться в прочитанном. Вы и заметить не успеете, как научитесь понимать язык другого, выражать ему любовь, и вскоре почувствуете, что и вас любят.",
      "Book Id": "220278968",
      "Days Spent": 2.0
    },
    {
      "Title": "Вторая сестра",
      "Author": "Chan Ho-Kei",
      "Additional Authors": "Чан Хо-Кей",
      "Number of Pages": 512,
      "Estimated Word Count": 140800,
      "Date Read": "2025-02-19",
      "Date Added": "2025-02-12",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "504383479X",
      "ISBN13": "9785386145408",
      "Cover URL": "http://books.google.com/books/content?id=kNZVEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "59222769",
      "Days Spent": 7.0
    },
    {
      "Title": "Прыжок",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 425,
      "Estimated Word Count": 116875,
      "Date Read": "2025-02-06",
      "Date Added": "2025-02-05",
      "My Rating": 5,
      "Series": "Соглашение",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=inK3EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "201229523",
      "Days Spent": 1.0
    },
    {
      "Title": "Предел",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 352,
      "Estimated Word Count": 96800,
      "Date Read": "2025-02-04",
      "Date Added": "2025-01-31",
      "My Rating": 5,
      "Series": "Соглашение",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5171233055",
      "ISBN13": "9785171233051",
      "Cover URL": "http://books.google.com/books/content?id=u5MwEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "58210523",
      "Days Spent": 4.0
    },
    {
      "Title": "Порог",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 352,
      "Estimated Word Count": 96800,
      "Date Read": "2025-02-01",
      "Date Added": "2025-01-23",
      "My Rating": 5,
      "Series": "Соглашение",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5171163014",
      "ISBN13": "9785171163013",
      "Cover URL": "http://books.google.com/books/content?id=TfqeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "46067196",
      "Days Spent": 9.0
    },
    {
      "Title": "Канашибари. Том 2",
      "Author": "Вероника и Ангелина Шэн",
      "Additional Authors": "",
      "Number of Pages": 384,
      "Estimated Word Count": 105600,
      "Date Read": "2025-01-22",
      "Date Added": "2025-01-19",
      "My Rating": 5,
      "Series": "Канашибари",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "535310899X",
      "ISBN13": "9785353108993",
      "Cover URL": "http://books.google.com/books/content?id=BqkzEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Фэнтези",
        "Молодёжная литература"
      ],
      "Annotation": "Мир кайданов, в который попала Хината, неумолим: как бы ты ни был измучен, какие бы раны ни получил, каких бы близких людей ни потерял, ты обязан играть дальше. Отказ от игры – смерть. Проигрыш – смерть. Секундная слабость или паника – смерть. И Хината сражается, проходя один жестокий кайдан за другим. Но что, если самая большая опасность подстерегает ее не в иллюзорных мирах кайданов, а в реальности? Что, если игроки, которых Хината наконец-то готова назвать друзьями, не те, за кого себя выдают?",
      "Book Id": "218689887",
      "Days Spent": 3.0
    },
    {
      "Title": "Канашибари. Том 1",
      "Author": "Вероника и Ангелина Шэн",
      "Additional Authors": "",
      "Number of Pages": 392,
      "Estimated Word Count": 107800,
      "Date Read": "2025-01-19",
      "Date Added": "2025-01-17",
      "My Rating": 5,
      "Series": "Канашибари",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "535310823X",
      "ISBN13": "9785353108238",
      "Cover URL": "http://books.google.com/books/content?id=Vo8JEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [
        "Фэнтези",
        "Молодёжная литература"
      ],
      "Annotation": "Японские студентки Хината и Минори возвращаются из библиотеки домой на автобусе. Обычная поездка заканчивается страшным ударом, криками... и темнотой. Когда подруги вновь открывают глаза, улицы родного Токио меняются немыслимым образом. Да и в Токио ли они вообще? Здания покорежены и смяты, электропровода оборваны, тротуары утопают в мусоре. Лишь одна старинная лавка кажется целой и невредимой. Только стоит ли входить в этот странный черный дом с яркой вывеской «Начало нового кайдана»? Когда за подругами захлопывается дверь, они понимают, что попали в ловушку. И выход из нее один: сыграть с монстрами в игру и победить. Но можно ли оставаться человеком, играя по чудовищным правилам?",
      "Book Id": "201959407",
      "Days Spent": 2.0
    },
    {
      "Title": "Рассечение Стоуна",
      "Author": "Abraham   Verghese",
      "Additional Authors": "Абрахам Вергезе, Сергей Соколов",
      "Number of Pages": 604,
      "Estimated Word Count": 166100,
      "Date Read": "2025-01-16",
      "Date Added": "2025-01-02",
      "My Rating": 5,
      "Series": null,
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5864717312",
      "ISBN13": "9785864717318",
      "Cover URL": "http://books.google.com/books/content?id=BaQwDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": "Эпический роман, написанный одним из самых авторитетных врачей мира «Рассечение Стоуна» – история любви длиною в жизнь, предательства и искупления, человеческой слабости и силы духа, изгнания и долгого возвращения к корням. В миссионерской больнице Адис-Абебы при трагических, истинно шекспировских, обстоятельствах рождаются два мальчика, два близнеца, сросшихся затылками, Мэрион и Шива. Рожденные прекрасной индийской монахиней от хирурга-англичанина, мальчики осиротели в первые часы жизни. Искусство и мужество врачей, разделивших их сразу после рождения, определило их жизнь и судьбу. Мэрион и Шива свяжут свою жизнь с медициной, но каждый пойдет своей дорогой. Их ждет удивительная, трагическая и полная невероятных событий судьба. Абсолютно счастливое детство и драматическая юность, поиски себя и своих корней, предательство и страстное желание искупить вину, любовь, похожая на наваждение, и ревность, изъедающая душу. И все это под сенью медицины. Что бы не происходило в жизни героев этого воистину большого романа, как бы не терзала их судьба, главным для них всегда оставалась хирургия – дело, ради которого они пришли в этот мир. Абрахам Вергезе – выдающийся доктор, светило в области физиотерапии, один из самых авторитетных врачей Америки. Его первый роман стал большим событием, удивительная проникновенность и достоверность, глубочайшее знание профессии и великолепный литературный стиль позволяют назвать книгу Вергезе одним из самых значительных медицинских романов последнего столетия.",
      "Book Id": "45238710",
      "Days Spent": 14.0
    },
    {
      "Title": "Лето волонтёра",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 413,
      "Estimated Word Count": 113575,
      "Date Read": "2025-01-02",
      "Date Added": "2024-12-28",
      "My Rating": 4,
      "Series": "Изменённые",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=l4mREAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "201229151",
      "Days Spent": 5.0
    },
    {
      "Title": "Месяц за Рубиконом",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 434,
      "Estimated Word Count": 119350,
      "Date Read": "2024-12-28",
      "Date Added": "2024-12-25",
      "My Rating": 4,
      "Series": "Изменённые",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=N99jEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "201276201",
      "Days Spent": 3.0
    },
    {
      "Title": "Три дня Индиго",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 350,
      "Estimated Word Count": 96250,
      "Date Read": "2024-12-25",
      "Date Added": "2024-12-20",
      "My Rating": 4,
      "Series": "Изменённые",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "",
      "ISBN13": "",
      "Cover URL": "http://books.google.com/books/content?id=e3tSEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "59529747",
      "Days Spent": 5.0
    },
    {
      "Title": "Семь дней до Мегиддо",
      "Author": "Sergei Lukyanenko",
      "Additional Authors": "Сергей Лукьяненко",
      "Number of Pages": 352,
      "Estimated Word Count": 96800,
      "Date Read": "2024-12-20",
      "Date Added": "2024-12-17",
      "My Rating": 4,
      "Series": "Изменённые",
      "Bookshelves": "",
      "Bookshelves with positions": "",
      "Exclusive Shelf": "read",
      "ISBN": "5171389888",
      "ISBN13": "9785171389888",
      "Cover URL": "http://books.google.com/books/content?id=e7M8EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "Genres": [],
      "Annotation": null,
      "Book Id": "58688819",
      "Days Spent": 3.0
    }
  ],
  "timeline": [
    {
      "Date": "2024-12",
      "Books": 4
    },
    {
      "Date": "2025-01",
      "Books": 4
    },
    {
      "Date": "2025-02",
      "Books": 6
    },
    {
      "Date": "2025-03",
      "Books": 5
    },
    {
      "Date": "2025-04",
      "Books": 2
    },
    {
      "Date": "2025-05",
      "Books": 5
    },
    {
      "Date": "2025-06",
      "Books": 4
    },
    {
      "Date": "2025-07",
      "Books": 5
    },
    {
      "Date": "2025-08",
      "Books": 6
    },
    {
      "Date": "2025-09",
      "Books": 2
    },
    {
      "Date": "2025-10",
      "Books": 2
    }
  ],
  "longest_book": {
    "Title": "Слова сияния",
    "Number of Pages": 1550
  },
  "shortest_book": {
    "Title": "The Eleventh Metal",
    "Number of Pages": 21
  }
}